MikroElektronika/core_packages/PIC/XC8/def/PIC18F13K22/mcu.h
extern volatile PORTAbits_t PORTAbits __at(0xF80);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA4_POSN                                     0x4
#define _PORTA_RA4_POSITION                                 0x4
#define _PORTA_RA4_SIZE                                     0x1
#define _PORTA_RA4_LENGTH                                   0x1
#define _PORTA_RA4_MASK                                     0x10
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20
#define _PORTA_AN0_POSN                                     0x0
#define _PORTA_AN0_POSITION                                 0x0
#define _PORTA_AN0_SIZE                                     0x1
#define _PORTA_AN0_LENGTH                                   0x1
#define _PORTA_AN0_MASK                                     0x1
#define _PORTA_AN1_POSN                                     0x1
#define _PORTA_AN1_POSITION                                 0x1
#define _PORTA_AN1_SIZE                                     0x1
#define _PORTA_AN1_LENGTH                                   0x1
#define _PORTA_AN1_MASK                                     0x2
#define _PORTA_AN2_POSN                                     0x2
#define _PORTA_AN2_POSITION                                 0x2
#define _PORTA_AN2_SIZE                                     0x1
#define _PORTA_AN2_LENGTH                                   0x1
#define _PORTA_AN2_MASK                                     0x4
#define _PORTA_MCLR_POSN                                    0x3
#define _PORTA_MCLR_POSITION                                0x3
#define _PORTA_MCLR_SIZE                                    0x1
#define _PORTA_MCLR_LENGTH                                  0x1
#define _PORTA_MCLR_MASK                                    0x8
#define _PORTA_AN3_POSN                                     0x4
#define _PORTA_AN3_POSITION                                 0x4
#define _PORTA_AN3_SIZE                                     0x1
#define _PORTA_AN3_LENGTH                                   0x1
#define _PORTA_AN3_MASK                                     0x10
#define _PORTA_T13CKI_POSN                                  0x5
#define _PORTA_T13CKI_POSITION                              0x5
#define _PORTA_T13CKI_SIZE                                  0x1
#define _PORTA_T13CKI_LENGTH                                0x1
#define _PORTA_T13CKI_MASK                                  0x20
#define _PORTA_NOT_MCLR_POSN                                0x3
#define _PORTA_NOT_MCLR_POSITION                            0x3
#define _PORTA_NOT_MCLR_SIZE                                0x1
#define _PORTA_NOT_MCLR_LENGTH                              0x1
#define _PORTA_NOT_MCLR_MASK                                0x8
#define _PORTA_CVREF_POSN                                   0x0
#define _PORTA_CVREF_POSITION                               0x0
#define _PORTA_CVREF_SIZE                                   0x1
#define _PORTA_CVREF_LENGTH                                 0x1
#define _PORTA_CVREF_MASK                                   0x1
#define _PORTA_C12IN0M_POSN                                 0x1
#define _PORTA_C12IN0M_POSITION                             0x1
#define _PORTA_C12IN0M_SIZE                                 0x1
#define _PORTA_C12IN0M_LENGTH                               0x1
#define _PORTA_C12IN0M_MASK                                 0x2
#define _PORTA_nMCLR_POSN                                   0x3
#define _PORTA_nMCLR_POSITION                               0x3
#define _PORTA_nMCLR_SIZE                                   0x1
#define _PORTA_nMCLR_LENGTH                                 0x1
#define _PORTA_nMCLR_MASK                                   0x8
#define _PORTA_OSC2_POSN                                    0x4
#define _PORTA_OSC2_POSITION                                0x4
#define _PORTA_OSC2_SIZE                                    0x1
#define _PORTA_OSC2_LENGTH                                  0x1
#define _PORTA_OSC2_MASK                                    0x10
#define _PORTA_OSC1_POSN                                    0x5
#define _PORTA_OSC1_POSITION                                0x5
#define _PORTA_OSC1_SIZE                                    0x1
#define _PORTA_OSC1_LENGTH                                  0x1
#define _PORTA_OSC1_MASK                                    0x20
#define _PORTA_VREFM_POSN                                   0x0
#define _PORTA_VREFM_POSITION                               0x0
#define _PORTA_VREFM_SIZE                                   0x1
#define _PORTA_VREFM_LENGTH                                 0x1
#define _PORTA_VREFM_MASK                                   0x1
#define _PORTA_VREFP_POSN                                   0x1
#define _PORTA_VREFP_POSITION                               0x1
#define _PORTA_VREFP_SIZE                                   0x1
#define _PORTA_VREFP_LENGTH                                 0x1
#define _PORTA_VREFP_MASK                                   0x2
#define _PORTA_T0CKI_POSN                                   0x2
#define _PORTA_T0CKI_POSITION                               0x2
#define _PORTA_T0CKI_SIZE                                   0x1
#define _PORTA_T0CKI_LENGTH                                 0x1
#define _PORTA_T0CKI_MASK                                   0x4
#define _PORTA_CLKOUT_POSN                                  0x4
#define _PORTA_CLKOUT_POSITION                              0x4
#define _PORTA_CLKOUT_SIZE                                  0x1
#define _PORTA_CLKOUT_LENGTH                                0x1
#define _PORTA_CLKOUT_MASK                                  0x10
#define _PORTA_CLKIN_POSN                                   0x5
#define _PORTA_CLKIN_POSITION                               0x5
#define _PORTA_CLKIN_SIZE                                   0x1
#define _PORTA_CLKIN_LENGTH                                 0x1
#define _PORTA_CLKIN_MASK                                   0x20
#define _PORTA_INT0_POSN                                    0x0
#define _PORTA_INT0_POSITION                                0x0
#define _PORTA_INT0_SIZE                                    0x1
#define _PORTA_INT0_LENGTH                                  0x1
#define _PORTA_INT0_MASK                                    0x1
#define _PORTA_INT1_POSN                                    0x1
#define _PORTA_INT1_POSITION                                0x1
#define _PORTA_INT1_SIZE                                    0x1
#define _PORTA_INT1_LENGTH                                  0x1
#define _PORTA_INT1_MASK                                    0x2
#define _PORTA_INT2_POSN                                    0x2
#define _PORTA_INT2_POSITION                                0x2
#define _PORTA_INT2_SIZE                                    0x1
#define _PORTA_INT2_LENGTH                                  0x1
#define _PORTA_INT2_MASK                                    0x4
#define _PORTA_PGD_POSN                                     0x0
#define _PORTA_PGD_POSITION                                 0x0
#define _PORTA_PGD_SIZE                                     0x1
#define _PORTA_PGD_LENGTH                                   0x1
#define _PORTA_PGD_MASK                                     0x1
#define _PORTA_PGC_POSN                                     0x1
#define _PORTA_PGC_POSITION                                 0x1
#define _PORTA_PGC_SIZE                                     0x1
#define _PORTA_PGC_LENGTH                                   0x1
#define _PORTA_PGC_MASK                                     0x2
#define _PORTA_VPP_POSN                                     0x3
#define _PORTA_VPP_POSITION                                 0x3
#define _PORTA_VPP_SIZE                                     0x1
#define _PORTA_VPP_LENGTH                                   0x1
#define _PORTA_VPP_MASK                                     0x8
#define _PORTA_C1INP_POSN                                   0x0
#define _PORTA_C1INP_POSITION                               0x0
#define _PORTA_C1INP_SIZE                                   0x1
#define _PORTA_C1INP_LENGTH                                 0x1
#define _PORTA_C1INP_MASK                                   0x1
#define _PORTA_SRQ_POSN                                     0x2
#define _PORTA_SRQ_POSITION                                 0x2
#define _PORTA_SRQ_SIZE                                     0x1
#define _PORTA_SRQ_LENGTH                                   0x1
#define _PORTA_SRQ_MASK                                     0x4
#define _PORTA_ULPWUIN_POSN                                 0x0
#define _PORTA_ULPWUIN_POSITION                             0x0
#define _PORTA_ULPWUIN_SIZE                                 0x1
#define _PORTA_ULPWUIN_LENGTH                               0x1
#define _PORTA_ULPWUIN_MASK                                 0x1
#define _PORTA_LVDIN_POSN                                   0x5
#define _PORTA_LVDIN_POSITION                               0x5
#define _PORTA_LVDIN_SIZE                                   0x1
#define _PORTA_LVDIN_LENGTH                                 0x1
#define _PORTA_LVDIN_MASK                                   0x20

// Register: PORTB
#define PORTB PORTB
extern volatile unsigned char           PORTB               __at(0xF81);
#ifndef _LIB_BUILD
asm("PORTB equ 0F81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
        unsigned RB6                    :1;
        unsigned RB7                    :1;
    };
    struct {
        unsigned                        :4;
        unsigned SDI                    :1;
        unsigned RX                     :1;
        unsigned SCL                    :1;
        unsigned TX                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned SDA                    :1;
        unsigned DT                     :1;
        unsigned SCK                    :1;
        unsigned CK                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned AN10                   :1;
        unsigned AN11                   :1;
    };
} PORTBbits_t;
extern volatile PORTBbits_t PORTBbits __at(0xF81);
// bitfield macros
#define _PORTB_RB4_POSN                                     0x4
#define _PORTB_RB4_POSITION                                 0x4
#define _PORTB_RB4_SIZE                                     0x1
#define _PORTB_RB4_LENGTH                                   0x1
#define _PORTB_RB4_MASK                                     0x10
#define _PORTB_RB5_POSN                                     0x5
#define _PORTB_RB5_POSITION                                 0x5
#define _PORTB_RB5_SIZE                                     0x1
#define _PORTB_RB5_LENGTH                                   0x1
#define _PORTB_RB5_MASK                                     0x20
#define _PORTB_RB6_POSN                                     0x6
#define _PORTB_RB6_POSITION                                 0x6
#define _PORTB_RB6_SIZE                                     0x1
#define _PORTB_RB6_LENGTH                                   0x1
#define _PORTB_RB6_MASK                                     0x40
#define _PORTB_RB7_POSN                                     0x7
#define _PORTB_RB7_POSITION                                 0x7
#define _PORTB_RB7_SIZE                                     0x1
#define _PORTB_RB7_LENGTH                                   0x1
#define _PORTB_RB7_MASK                                     0x80
#define _PORTB_SDI_POSN                                     0x4
#define _PORTB_SDI_POSITION                                 0x4
#define _PORTB_SDI_SIZE                                     0x1
#define _PORTB_SDI_LENGTH                                   0x1
#define _PORTB_SDI_MASK                                     0x10
#define _PORTB_RX_POSN                                      0x5
#define _PORTB_RX_POSITION                                  0x5
#define _PORTB_RX_SIZE                                      0x1
#define _PORTB_RX_LENGTH                                    0x1
#define _PORTB_RX_MASK                                      0x20
#define _PORTB_SCL_POSN                                     0x6
#define _PORTB_SCL_POSITION                                 0x6
#define _PORTB_SCL_SIZE                                     0x1
#define _PORTB_SCL_LENGTH                                   0x1
#define _PORTB_SCL_MASK                                     0x40
#define _PORTB_TX_POSN                                      0x7
#define _PORTB_TX_POSITION                                  0x7
#define _PORTB_TX_SIZE                                      0x1
#define _PORTB_TX_LENGTH                                    0x1
#define _PORTB_TX_MASK                                      0x80
#define _PORTB_SDA_POSN                                     0x4
#define _PORTB_SDA_POSITION                                 0x4
#define _PORTB_SDA_SIZE                                     0x1
#define _PORTB_SDA_LENGTH                                   0x1
#define _PORTB_SDA_MASK                                     0x10
#define _PORTB_DT_POSN                                      0x5
#define _PORTB_DT_POSITION                                  0x5
#define _PORTB_DT_SIZE                                      0x1
#define _PORTB_DT_LENGTH                                    0x1
#define _PORTB_DT_MASK                                      0x20
#define _PORTB_SCK_POSN                                     0x6
#define _PORTB_SCK_POSITION                                 0x6
#define _PORTB_SCK_SIZE                                     0x1
#define _PORTB_SCK_LENGTH                                   0x1
#define _PORTB_SCK_MASK                                     0x40
#define _PORTB_CK_POSN                                      0x7
#define _PORTB_CK_POSITION                                  0x7
#define _PORTB_CK_SIZE                                      0x1
#define _PORTB_CK_LENGTH                                    0x1
#define _PORTB_CK_MASK                                      0x80
#define _PORTB_AN10_POSN                                    0x4
#define _PORTB_AN10_POSITION                                0x4
#define _PORTB_AN10_SIZE                                    0x1
#define _PORTB_AN10_LENGTH                                  0x1
#define _PORTB_AN10_MASK                                    0x10
#define _PORTB_AN11_POSN                                    0x5
#define _PORTB_AN11_POSITION                                0x5
#define _PORTB_AN11_SIZE                                    0x1
#define _PORTB_AN11_LENGTH                                  0x1
#define _PORTB_AN11_MASK                                    0x20

// Register: PORTC
#define PORTC PORTC
extern volatile unsigned char           PORTC               __at(0xF82);
#ifndef _LIB_BUILD
asm("PORTC equ 0F82h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC0                    :1;
        unsigned RC1                    :1;
        unsigned RC2                    :1;
        unsigned RC3                    :1;
        unsigned RC4                    :1;
        unsigned RC5                    :1;
        unsigned RC6                    :1;
        unsigned RC7                    :1;
    };
    struct {
        unsigned AN4                    :1;
        unsigned AN5                    :1;
        unsigned AN6                    :1;
        unsigned AN7                    :1;
        unsigned                        :2;
        unsigned AN8                    :1;
        unsigned AN9                    :1;
    };
    struct {
        unsigned C12INP                 :1;
        unsigned C12IN1M                :1;
        unsigned C12IN2M                :1;
        unsigned C12IN3M                :1;
        unsigned C12OUT                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned P1D                    :1;
        unsigned P1C                    :1;
        unsigned P1B                    :1;
        unsigned P1A                    :1;
        unsigned SS                     :1;
        unsigned SDO                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_SS                 :1;
    };
    struct {
        unsigned C2INP                  :1;
        unsigned                        :2;
        unsigned PGM                    :1;
        unsigned                        :1;
        unsigned CCP1                   :1;
        unsigned nSS                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCP2                   :1;
        unsigned _PA1                    :1;  // Note: Changed by MikroE
    };
    struct {
        unsigned                        :1;
        unsigned _PA2                    :1;  // Note: Changed by MikroE
    };
} PORTCbits_t;
